import argparse
import os
import sys
import openpyxl

def main(argv):
    parser = argparse.ArgumentParser(description="Generate Excel File")
    parser.add_argument("--output", "-o", type=str, default="./superstars",
                        help="Output directory to save downloaded images.")
    parser.add_argument("--filename", "-f", type=str, default="test.xlsx",
                        help="Name of the Excel file.")
    args = parser.parse_args(args=argv)

    # 创建一个新的Excel工作簿
    wb = openpyxl.Workbook()
    ws = wb.active

    # 设置首行的标题
    ws.cell(row=1, column=1, value="姓名")

    # 男明星
    # names = [
    #     "陈赫", "陈坤", "邓超", "冯绍峰", "龚俊", "胡歌", "黄渤", "黄磊", "黄晓明", "黄子韬", "贾乃亮", "李晨", "李现",
    #     "鹿晗","靳东", "井柏然", "雷佳音", "刘烨", "陆毅", "沈腾", "孙红雷", "佟大为", "王宝强", "汪峰", "王俊凯", "王凯",
    #     "王一博","王源", "吴京", "肖战", "徐峥", "杨洋", "易烊千玺", "岳云鹏", "张翰", "张杰", "张一山", "张艺兴", "赵文卓",
    #     "郑恺","朱一龙", "艾伦", "白敬亭", "白举纲", "白客", "白宇", "包贝尔", "陈若轩", "陈翔", "陈晓", "陈学冬", "成毅",
    #     "丁禹兮","董成鹏", "董子健", "窦骁", "杜淳", "杜江", "段奕宏", "高伟光", "郭京飞", "郭俊辰", "郭麒麟", "郭晓东", "韩栋",
    #     "韩东君","韩庚", "侯明昊", "胡兵", "胡一天", "黄景瑜", "黄轩", "黄宥明", "金瀚", "李宏毅", "李佳航", "林更新", "刘昊然",
    #     "刘宇宁","罗晋", "罗云熙", "马可", "马天宇", "毛不易", "茅子俊", "聂远", "欧豪", "潘粤明", "彭冠英", "彭昱畅", "乔振宇",
    #     "秦俊杰","任嘉伦", "任重", "沙溢", "盛一伦", "释小龙", "宋威龙", "孙坚", "孙艺洲", "檀健次", "王传君", "王鹤棣",
    #     "王千源", "王学兵","王迅", "王栎鑫", "魏晨", "魏大勋", "吴磊", "小沈阳", "肖央", "邢昭林", "徐海乔", "许凯", "徐开骋", "许魏洲",
    #     "严屹宽","杨烁", "杨旭文", "叶祖新", "印小天", "尹正", "俞灏明", "于和伟", "于朦胧", "袁弘", "曾舜晞", "张彬彬",
    #     "张嘉益", "张晋","张伦硕", "张睿", "张若昀", "张晓龙", "张新成", "张译", "张云龙", "周一围", "朱亚文","毕雯珺", "蔡俊涛", "曹骏",
    #     "曹云金", "常远", "陈飞宇", "陈昊", "陈龙", "陈星旭", "陈宥维", "陈哲远", "陈震", "迟帅", "初俊辰", "大左", "戴景耀", "戴阳天",
    #     "丁程鑫", "董力", "范丞丞", "范世錡", "费启鸣", "冯建宇", "傅程鹏", "付辛博", "高至霆", "谷嘉诚", "谷智鑫", "管栎", "韩承羽",
    #     "郭晓峰", "郭子凡", "韩承羽", "何洛洛", "何晟铭", "黄觉", "黄明昊", "胡先煦", "霍尊", "季晨", "季肖冰", "姜潮", "蒋毅", "金世佳",
    #     "经超", "李晨浩", "李东学", "李光洁", "李茂", "李汶翰", "李泽锋", "林一", "林雨申", "凌潇肃", "刘畅", "刘芮麟", "刘学义",
    #     "刘奕畅", "刘智扬", "马雪阳", "米热", "宁桓宇", "牛骏峰", "裴子添", "彭楚粤", "蒲巴甲", "戚迹", "秦昊", "屈楚萧", "饶威",
    #     "孙伯纶", "谭凯", "田重", "佟梦实", "王博文", "王东", "汪铎", "王琳凯", "王龙华", "王乾越", "王彦霖", "王雨甜", "王自健",
    #     "王子异", "魏千翔", "魏巍", "伍嘉成", "吴俊余", "吴樾", "夏雨", "谢彬彬", "谢苗", "熊梓淇", "徐浩", "徐可", "徐正溪", "严浩翔",
    #     "焉栩嘉", "晏紫东", "杨九郎", "杨玏", "杨志刚", "应昊茗", "于波", "余少群", "于晓光", "于小彤", "于小伟", "于毅", "袁成杰",
    #     "袁文康", "扎西顿珠", "查杰", "张博", "张铎", "张赫", "张峻宁", "张凌赫", "张鲁一", "张铭恩", "张桐", "张晓晨", "张逸杰", "张雨剑",
    #     "张远", "张云雷", "张倬闻", "赵雷", "赵品霖", "赵志伟", "郑业成", "邹廷威", "周艺轩", "朱刚日尧", "朱星杰", "朱泳腾", "朱雨辰",
    #     "朱正廷", "朱梓骁", "祖峰", "左溢"
    # ]
    # 女明星
    names = [
        "Angelababy", "迪丽热巴", "关晓彤", "贾玲", "李冰冰", "刘诗诗", "刘涛", "刘亦菲", "倪妮", "宋佳", "宋茜",
        "孙俪", "唐嫣", "佟丽娅", "谢娜", "杨幂", "杨紫", "姚晨", "章子怡", "赵丽颖", "赵露思", "周冬雨", "周迅",
        "白百何", "白鹿", "蔡文静", "陈数", "陈钰琪", "陈紫函", "邓家佳", "董璇", "高露", "高圆圆", "古力娜扎",
        "海陆", "海清", "韩雪", "郝蕾", "胡冰卿", "胡静", "黄圣依", "黄奕", "霍思燕", "贾青", "江疏影", "蒋梦婕",
        "蒋勤勤", "蒋欣", "蒋依依", "江映蓉", "江一燕", "焦俊艳", "金晨", "景甜", "鞠婧祎", "阚清子", "辣目洋子",
        "李菲儿", "李沁", "李晟", "李溪芮", "李小冉", "李一桐", "林允", "刘浩存", "刘惜君", "柳岩", "刘芸", "娄艺潇",
        "吕一", "马丽", "马思纯", "马苏", "马伊俐", "毛晓彤", "梅婷", "孟美岐", "戚薇", "秦海璐", "秦岚", "任素汐",
        "沈梦辰", "沈月", "舒畅", "宋轶", "宋祖儿", "孙怡", "谭松韵", "谭维维", "唐艺昕", "童瑶", "万茜", "王丽坤",
        "王珞丹", "王鸥", "王晓晨", "王子文", "吴谨言", "吴倩", "吴宣仪", "邢菲", "徐璐", "杨超越", "杨蓉", "叶璇",
        "殷桃", "颖儿", "虞书欣", "袁冰妍", "袁泉", "袁姗姗", "赵今麦", "赵樱子", "张慧雯", "张俪", "张萌", "张含韵",
        "张嘉倪", "张天爱", "张小斐", "张歆艺", "张馨予", "张雪迎", "张雨绮", "张子枫", "左小青","安悦溪", "白冰", "曹曦文",
        "曹曦月", "曹颖", "车永莉", "车晓", "柴碧云", "陈冰", "陈都灵", "陈昊宇", "陈燃", "陈小纭", "陈瑶", "程潇",
        "程砚秋", "代斯", "邓莎", "董维嘉", "杜鹃", "杜若溪", "段奥娟", "方安娜", "傅菁", "付梦妮", "盖玥希", "甘露",
        "甘婷婷", "甘薇", "高洋", "龚蓓苾", "贡米", "关雪盈", "郭柯彤", "郭晓婷", "哈妮克孜", "何泓姗", "侯梦瑶", "胡可",
        "黄灿灿", "黄龄", "黄梦莹", "黄婷婷", "黄雅莉", "黄一琳", "纪姿含", "菅纫姿", "江铠同", "姜妍", "金巧巧", "金莎",
        "斓曦", "蓝盈莹", "李艾", "李纯", "李兰迪", "李金铭", "李曼", "李梦", "李萌萌", "厉娜", "李念", "李倩", "李艺彤",
        "黎一萱", "梁洁", "林静", "林妙可", "林鹏", "刘美含", "刘萌萌", "刘敏涛", "刘人语", "刘庭羽", "路晨", "陆婷", "吕佳容",
        "麦迪娜", "毛俊杰", "毛林林", "毛晓慧", "孟佳", "孟子义", "米露", "苗苗", "苗圃", "莫寒", "莫小棋", "倪虹洁", "牟星",
        "穆婷婷", "宁丹琳", "牛莉", "乔欣", "潘辰", "潘时七", "彭小苒", "戚砚笛", "热依扎", "任敏", "商侃", "尚语贤", "沈傲君",
        "施予斐", "宋妍霏", "宋伊人", "苏青", "孙茜", "孙骁骁", "孙耀琦", "谈莉娜", "谭卓", "汤晶媚", "田海蓉", "陶昕然", "童可可",
        "童蕾", "王楚然", "王琳", "王瑞子", "王秀竹", "王婉中", "王一菲", "王媛可", "王智", "王紫璇", "王子璇", "温心", "邬靖靖",
        "吴莫愁", "吴优", "奚梦瑶", "肖燕", "辛芷蕾", "熊黛林", "熊乃瑾", "徐冬冬", "徐娇", "许龄月", "许佳琪", "徐梦洁", "徐悦",
        "宣璐", "杨子姗", "姚笛", "姚芊羽", "姚星彤", "叶青", "尤靖茹", "余男", "雨婷儿", "战菁一", "张佳宁", "张蓝心", "章龄之",
        "张檬", "章若楠", "张杨果而", "张瑶", "张予曦", "张月", "张紫宁", "张子萱", "张芷溪", "瞿颖", "赵奕欢", "赵圆瑗", "赵子琪",
        "郑合惠子", "郑罗茜", "钟楚曦", "种丹妮", "周洁琼", "周雨彤", "朱圣祎", "祝绪丹", "朱珠"
    ]
    # names = [
    #     "佟丽娅", "谢娜", "杨幂","韩雪", "郝蕾", "胡冰卿"
    # ]

    # 将人名写入Excel表格
    for idx, name in enumerate(names, start=2):
        ws.cell(row=idx, column=1, value=name)

    # 拼接文件的完整路径
    file_path = os.path.join(args.output, args.filename).replace("\\", "/")

    # 确保输出目录存在
    os.makedirs(args.output, exist_ok=True)

    # 保存Excel文件
    wb.save(file_path)

    print(f"Excel file has been saved in: {file_path}")


if __name__ == '__main__':
    main(sys.argv[1:])

# python gen_excel.py -f test.xlsx
